In [2]:
import pandas as pd
import numpy as np

# 1차원 배열 -> Series
obj = pd.Series([3, 6, 9, 12])
print(obj)

0     3
1     6
2     9
3    12
dtype: int64

In [6]:
# 문자열 index도 사용가능
obj = pd.Series([3,6,9,12], index = ['a','b','c','d'])
print(obj)

a     3
b     6
c     9
d    12
dtype: int64

In [7]:
a = pd.DataFrame([[10,20,30], [40,50,60],[70,80,90]])
a

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [22]:
# 딕셔너리를 이용하여 데이터프레임 생성
# table = pd.DataFrame({key:value})
table = pd.DataFrame({
    "체중":[80,70.4,68,75.3,52],
    "신장":[170,180,155,175,160],
    "성별":['남','남','여','남','여']
})
table

     체중   신장 성별
0  80.0  170  남
1  70.4  180  남
2  68.0  155  여
3  75.3  175  남
4  52.0  160  여

In [23]:
table['체중']

0    80.0
1    70.4
2    68.0
3    75.3
4    52.0
Name: 체중, dtype: float64

In [24]:
table[['신장', '체중']]

    신장    체중
0  170  80.0
1  180  70.4
2  155  68.0
3  175  75.3
4  160  52.0

In [25]:
# 대괄호 [] 안에는 조건식이 올 수 있다!!

table[table.성별 == '남']

     체중   신장 성별
0  80.0  170  남
1  70.4  180  남
3  75.3  175  남

In [26]:
table['성별'] = '남'
print(table)

     체중   신장 성별
0  80.0  170  남
1  70.4  180  남
2  68.0  155  남
3  75.3  175  남
4  52.0  160  남

In [27]:
table['성별'] = ['남', '여', '남', '남', '여']
table

     체중   신장 성별
0  80.0  170  남
1  70.4  180  여
2  68.0  155  남
3  75.3  175  남
4  52.0  160  여

In [28]:
table['나이'] = np.arange(10,15)
table

     체중   신장 성별  나이
0  80.0  170  남  10
1  70.4  180  여  11
2  68.0  155  남  12
3  75.3  175  남  13
4  52.0  160  여  14

In [32]:
# iloc[행, 열]
# iloc[시작행: 마지막행, 시작열:마지막열]
table.iloc[2, :]

체중     68
신장    155
성별      남
나이     12
Name: 2, dtype: object

In [30]:
table.iloc[:,:2]

     체중   신장
0  80.0  170
1  70.4  180
2  68.0  155
3  75.3  175
4  52.0  160

In [33]:
# 6행 4열짜리 팬덤함수를 이용하여 데이터 프레임 생성
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  0.017026  0.719558 -0.207016 -0.150520
1  0.908521  0.854151  0.680642  0.606735
2  0.527975  2.129914 -1.303058 -0.137720
3  1.234868  0.452526  0.683382 -2.128813
4  0.278637  0.727046  1.167227 -0.058012
5  0.805531  0.901811  1.625251 -0.274644

In [35]:
# 컬럼 이름 지정
# data.range("시작날짜", 옵션)
df.index = pd.date_range('20200728', periods=6)
df

                   0         1         2         3
2020-07-28  0.017026  0.719558 -0.207016 -0.150520
2020-07-29  0.908521  0.854151  0.680642  0.606735
2020-07-30  0.527975  2.129914 -1.303058 -0.137720
2020-07-31  1.234868  0.452526  0.683382 -2.128813
2020-08-01  0.278637  0.727046  1.167227 -0.058012
2020-08-02  0.805531  0.901811  1.625251 -0.274644

In [38]:
df.drop(3, axis = 1)

                   0         1         2
2020-07-28  0.017026  0.719558 -0.207016
2020-07-29  0.908521  0.854151  0.680642
2020-07-30  0.527975  2.129914 -1.303058
2020-07-31  1.234868  0.452526  0.683382
2020-08-01  0.278637  0.727046  1.167227
2020-08-02  0.805531  0.901811  1.625251

In [41]:
df.drop([2,3], axis = 1)

                   0         1
2020-07-28  0.017026  0.719558
2020-07-29  0.908521  0.854151
2020-07-30  0.527975  2.129914
2020-07-31  1.234868  0.452526
2020-08-01  0.278637  0.727046
2020-08-02  0.805531  0.901811